QWEN3-Next-80B-A3B-Instruct/benchmark_QWEN3-Next_1k1k_conc_32.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=1024, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=32, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='', model='/models/Qwen3-Next-80B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=1024, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=32, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 1048576
#Output tokens: 1048576
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 1024/1024 [04:56<00:00,  3.45it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     1024      
Benchmark duration (s):                  296.62    
Total input tokens:                      1048576   
Total input text tokens:                 1048576   
Total input vision tokens:               0         
Total generated tokens:                  1048576   
Total generated tokens (retokenized):    1048217   
Request throughput (req/s):              3.45      
Input token throughput (tok/s):          3535.12   
Output token throughput (tok/s):         3535.12   
Total token throughput (tok/s):          7070.24   
Concurrency:                             31.98     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   9262.38   
Median E2E Latency (ms):                 9259.04   
---------------Time to First Token----------------
Mean TTFT (ms):                          567.14    
Median TTFT (ms):                        585.72    
P99 TTFT (ms):                           712.77    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           8.50      
Median ITL (ms):                         8.45      
P95 ITL (ms):                            8.84      
P99 ITL (ms):                            9.40      
Max ITL (ms):                            279.84    
==================================================